OPENQASM 2.0;
include "qelib1.inc";
qreg q[16];

// ψ₀ ↔ ψ₁
CX q[0], q[1];
// ψ₀ ↔ ψ₄
CX q[0], q[4];
// ψ₀ ↔ ψ₅
CX q[0], q[5];
// ψ₁ ↔ ψ₂
CX q[1], q[2];
// ψ₁ ↔ ψ₄
CX q[1], q[4];
// ψ₁ ↔ ψ₅
CX q[1], q[5];
// ψ₁ ↔ ψ₆
CX q[1], q[6];
// ψ₂ ↔ ψ₃
CX q[2], q[3];
// ψ₂ ↔ ψ₅
CX q[2], q[5];
// ψ₂ ↔ ψ₆
CX q[2], q[6];
// ψ₂ ↔ ψ₇
CX q[2], q[7];
// ψ₃ ↔ ψ₆
CX q[3], q[6];
// ψ₃ ↔ ψ₇
CX q[3], q[7];
// ψ₄ ↔ ψ₅
CX q[4], q[5];
// ψ₄ ↔ ψ₈
CX q[4], q[8];
// ψ₄ ↔ ψ₉
CX q[4], q[9];
// ψ₅ ↔ ψ₆
CX q[5], q[6];
// ψ₅ ↔ ψ₈
CX q[5], q[8];
// ψ₅ ↔ ψ₉
CX q[5], q[9];
// ψ₅ ↔ ψ₁₀
CX q[5], q[10];
// ψ₆ ↔ ψ₇
CX q[6], q[7];
// ψ₆ ↔ ψ₉
CX q[6], q[9];
// ψ₆ ↔ ψ₁₀
CX q[6], q[10];
// ψ₆ ↔ ψ₁₁
CX q[6], q[11];
// ψ₇ ↔ ψ₁₀
CX q[7], q[10];
// ψ₇ ↔ ψ₁₁
CX q[7], q[11];
// ψ₈ ↔ ψ₉
CX q[8], q[9];
// ψ₈ ↔ ψ₁₂
CX q[8], q[12];
// ψ₈ ↔ ψ₁₃
CX q[8], q[13];
// ψ₉ ↔ ψ₁₀
CX q[9], q[10];
// ψ₉ ↔ ψ₁₂
CX q[9], q[12];
// ψ₉ ↔ ψ₁₃
CX q[9], q[13];
// ψ₉ ↔ ψ₁₄
CX q[9], q[14];
// ψ₁₀ ↔ ψ₁₁
CX q[10], q[11];
// ψ₁₀ ↔ ψ₁₃
CX q[10], q[13];
// ψ₁₀ ↔ ψ₁₄
CX q[10], q[14];
// ψ₁₀ ↔ ψ₁₅
CX q[10], q[15];
// ψ₁₁ ↔ ψ₁₄
CX q[11], q[14];
// ψ₁₁ ↔ ψ₁₅
CX q[11], q[15];
// ψ₁₂ ↔ ψ₁₃
CX q[12], q[13];
// ψ₁₃ ↔ ψ₁₄
CX q[13], q[14];
// ψ₁₄ ↔ ψ₁₅
CX q[14], q[15];
